RL10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         60;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  on;

maxCo           0.2;
maxAlphaCo      0.2;

maxDeltaT       0.01;

functions


{
  //calculate and monitor the total volumeo of water in the domain

  totalWaterVolume
  {
    type            volFieldValue;
    libs            ("libfieldFunctionObjects.so");
    fields          (alpha.water);
    writeFields     no; // yes | no
    writeControl    writeTime;
    regionType      all;
    operation       volIntegrate;
  } 



  //calcualte the water flux (discharge) at the outlet
  outletDischarge
  {
    type            surfaceFieldValue;
    libs            ("libfieldFunctionObjects.so");
    fields          (phi);
    writeFields     no; // yes | no
    regionType      patch;
    name            outlet;
    operation       weightedSum;


    // List of oriented fields
    //orientedFields  (<field names>);

    // Weight field - must be a scalar
    weightField     alpha.water;

    // Write the total area of the faces
    writeArea       yes;
  }

}


// ************************************************************************* //
