RL10/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xi   -10.5;
xf    9;
yi   -3.5;
yf    3.5;
zi   -1.6;
zf   1.9;

nx   195;          // Background resolution : 0.1m.
ny   70;
nz   35;
         


vertices
(
    ($xi $yi $zi) //0
    ($xf $yi $zi) //1
    ($xf $yf $zi) //2
    ($xi $yf $zi) //3
    ($xi $yi $zf) //4
    ($xf $yi $zf) //5
    ($xf $yf $zf) //6
    ($xi $yf $zf) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet   {type patch; faces ((0 4 7 3)); }
    outlet  {type patch; faces ((2 6 5 1)); }
    
    front   {type wall; faces ((1 5 4 0)); }
    back    {type wall; faces ((3 7 6 2)); }
    bottom  {type patch; faces ((0 3 2 1)); }
    top     {type patch; faces ((4 5 6 7)); }
);

// ************************************************************************* //
