RL10/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 10;
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        phi             phi;
        value           uniform (0 0 0);
    }

    top 
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    bed 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    front
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wall1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    wall2
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* //
