RL10/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type           zeroGradient;
    }

    outlet
    {
        type            totalPressure;
        p0              uniform 0;
    }

    top 
    {
        type            totalPressure;
        p0              uniform 0;
    }

    bed   
    {
        type            zeroGradient;
    }

    front
    {
        type            zeroGradient;
    }
    back
    {
        type            zeroGradient;
    }

    wall1
    {
        type            zeroGradient;
    }
    wall2
    {       
        type            zeroGradient;
    }
}

// ************************************************************************* //
