RL10/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    top 
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    bed
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    front
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    back
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    wall1
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    wall2
    {
        type            kqRWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
