RL10/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;       
}

gradSchemes
{
    default         cellLimited Gauss linear 0.5;
}

divSchemes
{
    default             Gauss upwind;
    div(rhoPhi,U)       Gauss linearUpwind grad(U); 
    div(phi,alpha)      Gauss vanLeer;
     div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    "div\(phi,(k|omega)\)"      Gauss upwind;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 0.5; 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pd;
    pcorr;
    alpha1;
    alpha.water;



}


// ************************************************************************* //
