RL10/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |  
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probes
{
    fields ( U );
    probeLocations
    (
    (5.3 -0.0216199 0.573402)
    (7.004 -7.91 0.74)
    
   );

    #includeEtc "caseDicts/postProcessing/probes/probes.cfg"
}

// ************************************************************************* //
